<!--짝 맞추기 라이브 코딩 순서-->

<!--1. 요구사항을 state - view - action으로 분리 해서 생각하는 작업-->
<!--2. 마크업 개발자니 view를 통해서 state를 추려내는게 더 쉬울것-->
<!--3. 일단 view부터 만들어 보자. (대강 카드 만든다)-->
<!--4. 컨트롤 c + v-->
<!--5. 이걸 하면 반복임. 이런 반복을 담당하는 state의 type을 javascript에서 array라고 부름 [1,2,3] 혹은 ["a","b","c"]-->
<!--6. svelte에서는 each를 통해 반복을 binding함-->
<!--7. 배열의 내용에 따라 달라지는 걸 보여줌-->
<!--8. 뒤집어진 카드는 어떻게?-->
<!--9. 카드 하나를 Object로 만듬-->
<!--10. Object는 연관된 데이터를 하나로 가지는 거-->
<!--11. card.text card.is_closed-->
<!--12. 바인딩을 수정함-->
<!--13. view와 state는 끝-->
<!--14. action은? 카드를 선택 => 뒤집음  card.is_closed = false-->
<!--15. 카드를 두번째 선택 - 비교해서 같으면 OK 아니면 다시 둘을 돌려놓음-->
<!--16. (숨겨진 시나리오) 이미 오픈된 카드 선택하면?-->
<!--17. state => action + state => new state : 비지니스 로직이라고 부름(기획서의 언어를 비지니스 로직으로 푸는게 개발자의 능력)-->
<!--18. setTimeout()을 이용해 적당한 view표현-->